tap 'homebrew/bundle'

# General setup
brew 'autojump'
brew 'gh'
brew 'git'
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'python3'
brew 'sqlite'
brew 'postgresql'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Apps 
cask 'iterm2'
cask 'rectangle'
cask 'google-chrome'
cask 'visual-studio-code'
cask '1password'
cask 'spotify'
cask 'docker'