tap 'homebrew/bundle'

# General setup
brew 'autojump'
brew 'gh'
brew 'git'
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'python3'
brew 'sqlite'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Apps 
cask 'iterm2'
cask 'rectangle'
cask 'google-chrome'
cask 'visual-studio-code'
cask '1password'
cask 'spotify'
cask 'docker'

# VSCode - Extensions
vscode '4ops.terraform'
vscode 'bradlc.vscode-tailwindcss'
vscode 'catppuccin.catppuccin-vsc'
vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'esbenp.prettier-vscode'
vscode 'github.vscode-github-actions'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-vscode-remote.remote-containers'
vscode 'sanity-io.vscode-sanity'
vscode 'tamasfe.even-better-toml'
vscode 'teabyii.ayu'
vscode 'tonybaloney.vscode-pets'
vscode 'waderyan.gitblame'
vscode 'yoavbls.pretty-ts-errors'
